Repository: elchief84/milkly.mobile
Catalog: lib/l10n/app_*.arb
Languages: it

# appTagline
source: Breastfeeding tracking made simple
it: Tracciamento dell'allattamento semplificato

source: Plan
it: Piano

source: Growth
it: Crescita

source: Settings
it: Impostazioni

source: Welcome to Milkly
it: Benvenuto in Milkly

# onboardingSubtitle
source: Let's set up your breastfeeding plan together
it: Configuriamo insieme il tuo piano di allattamento

source: Get Started
it: Inizia

# dashboardTimerPlaceholder
source: Dashboard & feeding timer will go here
it: Dashboard e timer di allattamento andranno qui

# planSchedulePlaceholder
source: Feeding plan & schedule will go here
it: Piano e programmazione allattamento andranno qui

# growthTrackingPlaceholder
source: Baby growth tracking will go here
it: Tracciamento crescita del bambino andrà qui

# settingsPreferencesPlaceholder
source: App settings & preferences will go here
it: Impostazioni e preferenze dell'app andranno qui

# chatbotPlaceholder
source: (Guided chatbot flow will go here)
it: (Il flusso guidato del chatbot andrà qui)

# commonCancel
source: Cancel
it: Annulla

# commonConfirm
source: Confirm
it: Conferma

# commonSkip
source: Skip
it: Salta

# chatAssistantLabel
source: Assistant
it: Assistente

# chatUserLabel
source: You
it: Tu

# onboardingStartTitle
source: Start your journey
it: Inizia il tuo percorso

# onboardingChatWelcomeMessage
source: Welcome! Let's set up your personalized feeding plan.
it: Benvenuta! Configuriamo il tuo piano personalizzato di allattamento.

# onboardingPhotoSourceTitle
source: Choose source
it: Scegli sorgente

# onboardingPhotoSourceCamera
source: Camera
it: Fotocamera

# onboardingPhotoSourceGallery
source: Gallery
it: Galleria

# onboardingReviewTitle
source: Confirm your plan
it: Conferma il tuo piano

# onboardingReviewAnswersTitle
source: Answers summary
it: Riepilogo risposte

# onboardingReviewCreatePlanCta
source: Confirm and create the plan
it: Conferma e crea il piano

# onboardingInputHint
source: Enter your answer
it: Inserisci la risposta

# onboardingNumberHint
source: Enter a number
it: Inserisci un numero

# onboardingTextPlaceholder
source: Type here...
it: Scrivi qui...

# onboardingNumberPlaceholder
source: Enter a number...
it: Inserisci un numero...

# onboardingSelectDate
source: Select date
it: Seleziona data

# onboardingSelectTime
source: Select time
it: Seleziona orario

# onboardingPhotoLoadError
source: Error loading photo: {error}
it: Errore nel caricamento della foto: {error}

# onboardingPhotoTake
source: Take a photo
it: Scatta una foto

# onboardingPhotoPick
source: Choose from gallery
it: Scegli dalla galleria

# onboardingPhotoRemove
source: Remove photo
it: Rimuovi foto

# onboardingPhotoAdd
source: Add a photo
it: Aggiungi una foto

# onboardingPhotoHint
source: Take or choose from gallery
it: Scatta o scegli dalla galleria

# onboardingPhotoUploadedLabel
source: 📷 Photo uploaded
it: 📷 Foto caricata

# onboardingSexUnspecified
source: Unspecified
it: Non specificato

# onboardingLoadError
source: Failed to load questionnaire: {error}
it: Impossibile caricare il questionario: {error}

# bfOnboarding_questionnaire_step_childProfile_title
source: Baby details
it: Dati del bambino

# bfOnboarding_questionnaire_step_feedingStatus_title
source: Current feeding situation
it: Situazione attuale di alimentazione

# bfOnboarding_questionnaire_step_pediatricPlan_title
source: Pediatrician’s plan
it: Indicazioni del pediatra

# bfOnboarding_questionnaire_step_feedTimersAndBreast_title
source: Feed timers and breast side
it: Timer poppate e lato del seno

# bfOnboarding_questionnaire_step_pumping_title
source: Pumping
it: Tiralatte

# bfOnboarding_questionnaire_step_night_title
source: Night-time management
it: Gestione della notte

# bfOnboarding_questionnaire_step_otherChildren_title
source: Other children
it: Altri bambini

# bfOnboarding_questionnaire_childName_title
source: What is your baby’s name?
it: Come si chiama il tuo bambino?

# bfOnboarding_questionnaire_childBirthDate_title
source: What is your baby’s date of birth?
it: Qual è la sua data di nascita?

# bfOnboarding_questionnaire_childSex_title
source: What is your baby’s sex?
it: Qual è il suo sesso?

# bfOnboarding_questionnaire_childSex_option_male
source: Male
it: Maschio

# bfOnboarding_questionnaire_childSex_option_female
source: Female
it: Femmina

# bfOnboarding_questionnaire_childSex_option_other
source: Other / prefer not to specify
it: Altro / non voglio specificare

# bfOnboarding_questionnaire_childrenInThisBirth_title
source: How many babies are you following from this birth?
it: Quanti bambini stai seguendo con questo parto?

# bfOnboarding_questionnaire_childrenInThisBirth_option_one
source: One
it: Uno

# bfOnboarding_questionnaire_childrenInThisBirth_option_twins
source: Twins
it: Gemelli

# bfOnboarding_questionnaire_childrenInThisBirth_option_moreThanTwo
source: More than two
it: Più di due

# bfOnboarding_questionnaire_currentFeedingMode_title
source: How are you currently feeding {childName}?
it: In questo momento come stai nutrendo {childName}?

# bfOnboarding_questionnaire_currentFeedingMode_option_breastOnly
source: Only at the breast
it: Solo al seno

# bfOnboarding_questionnaire_currentFeedingMode_option_breastAndPumped
source: Breast + pumped breast milk (bottle)
it: Seno + latte materno tirato (biberon)

# bfOnboarding_questionnaire_currentFeedingMode_option_breastAndFormula
source: Breast + formula
it: Seno + latte artificiale (formula)

# bfOnboarding_questionnaire_currentFeedingMode_option_pumpedOnly
source: Only pumped breast milk (no direct latch)
it: Solo latte materno tirato (no attacco al seno)

# bfOnboarding_questionnaire_currentFeedingMode_option_formulaOnly
source: Only formula
it: Solo latte artificiale

# bfOnboarding_questionnaire_currentFeedingMode_option_other
source: Other
it: Altro

# bfOnboarding_questionnaire_avgFeedsPerDay_title
source: On average, how many feeds does {childName} have in 24 hours?
it: In media quante poppate fa {childName} in 24 ore?

# bfOnboarding_questionnaire_bottleUsage_title
source: Are you currently using a bottle with {childName}?
it: Al momento usi già il biberon con {childName}?

# bfOnboarding_questionnaire_bottleUsage_option_never
source: No, never
it: No, mai

# bfOnboarding_questionnaire_bottleUsage_option_sometimes
source: Yes, sometimes
it: Sì, ogni tanto

# bfOnboarding_questionnaire_bottleUsage_option_regular
source: Yes, regularly (at least 1–2 times a day)
it: Sì, regolarmente (almeno 1–2 volte al giorno)

# bfOnboarding_questionnaire_pediatricFeedingMode_title
source: How did your pediatrician recommend feeding {childName}?
it: Il tuo pediatra ti ha consigliato di allattare {childName}…

# bfOnboarding_questionnaire_pediatricFeedingMode_option_onDemand
source: On demand (whenever the baby asks)
it: A richiesta (quando il bambino lo chiede)

# bfOnboarding_questionnaire_pediatricFeedingMode_option_intervals
source: At more or less regular intervals
it: A intervalli più o meno regolari

# bfOnboarding_questionnaire_pediatricFeedingMode_option_mixed
source: A combination of the two
it: Una combinazione delle due

# bfOnboarding_questionnaire_pediatricFeedingMode_option_notDefined
source: It has not been defined in detail
it: Non è stato definito in dettaglio

# bfOnboarding_questionnaire_dayIntervalDescription_title
source: Roughly how far apart should daytime feeds be?
it: Ogni quanto circa dovrebbero essere distanziate le poppate di giorno?

# bfOnboarding_questionnaire_dayIntervalDescription_note
source: For example: every 2–3 hours
it: Ad esempio: ogni 2–3 ore

# bfOnboarding_questionnaire_nightIntervalType_title
source: And at night, did the pediatrician give you a reference interval?
it: E di notte, il pediatra ti ha dato un intervallo indicativo?

# bfOnboarding_questionnaire_nightIntervalType_option_sameAsDay
source: Same interval as during the day
it: Stesso intervallo del giorno

# bfOnboarding_questionnaire_nightIntervalType_option_different
source: Different interval (max X hours)
it: Intervallo diverso (max X ore)

# bfOnboarding_questionnaire_nightIntervalType_option_notDefined
source: No specific interval was defined
it: Non è stato definito un intervallo specifico

# bfOnboarding_questionnaire_nightMaxIntervalHours_title
source: What is the maximum night-time interval (in hours)?
it: Qual è l’intervallo massimo notturno (in ore)?

# bfOnboarding_questionnaire_maxIntervalAnytimeDefined_title
source: Did the pediatrician give you a maximum number of hours between feeds that should not be exceeded?
it: Il pediatra ti ha indicato un numero massimo di ore da non superare tra una poppata e l’altra?

# bfOnboarding_questionnaire_maxIntervalAnytimeDefined_option_yes
source: Yes, a maximum number of hours
it: Sì, un numero massimo di ore

# bfOnboarding_questionnaire_maxIntervalAnytimeDefined_option_dontKnow
source: I don’t remember
it: Non ricordo

# bfOnboarding_questionnaire_maxIntervalAnytimeHours_title
source: What is the maximum number of hours between feeds?
it: Quante ore al massimo tra una poppata e l’altra?

# bfOnboarding_questionnaire_trackLastBreast_title
source: Would you like to track which breast you last used to feed {childName}?
it: Vuoi tenere traccia da che lato hai allattato {childName} per ultimo?

# bfOnboarding_questionnaire_trackLastBreast_option_yes
source: Yes, that would be helpful
it: Sì, mi sarebbe utile

# bfOnboarding_questionnaire_trackLastBreast_option_no
source: No, it’s not necessary
it: No, non è necessario

# bfOnboarding_questionnaire_breastPattern_title
source: How do you usually manage breasts during a feed?
it: Di solito come preferisci gestire i seni durante la poppata?

# bfOnboarding_questionnaire_breastPattern_option_onePerFeed
source: One breast per feed
it: Un solo seno per poppata

# bfOnboarding_questionnaire_breastPattern_option_bothPerFeed
source: Both breasts in the same feed
it: Entrambi i seni nella stessa poppata

# bfOnboarding_questionnaire_breastPattern_option_depends
source: It depends, I don’t have a fixed pattern
it: Dipende, non ho uno schema fisso

# bfOnboarding_questionnaire_feedTimerUsage_title
source: Would you like to use a timer to measure feed duration?
it: Vuoi usare un timer per misurare la durata delle poppate?

# bfOnboarding_questionnaire_feedTimerUsage_option_fullTimer
source: Yes, with a start/stop stopwatch
it: Sì, con cronometro avvio/stop

# bfOnboarding_questionnaire_feedTimerUsage_option_approx
source: Yes, but an approximate indication is enough
it: Sì, ma mi basta un’indicazione approssimativa

# bfOnboarding_questionnaire_feedTimerUsage_option_no
source: No, I don’t need it
it: No, non mi serve

# bfOnboarding_questionnaire_nextFeedReminder_title
source: Would you like the app to remind you when the next feed is approaching, based on the pediatrician’s indications?
it: Vuoi che l’app ti avvisi quando si avvicina il momento della prossima poppata, in base alle indicazioni del pediatra?

# bfOnboarding_questionnaire_nextFeedReminder_option_before
source: Yes, a few minutes before
it: Sì, qualche minuto prima

# bfOnboarding_questionnaire_nextFeedReminder_option_onTime
source: Yes, at the estimated time
it: Sì, all’orario stimato

# bfOnboarding_questionnaire_nextFeedReminder_option_no
source: No, I prefer to just see the history
it: No, preferisco solo vedere lo storico

# bfOnboarding_questionnaire_pediatricPumpingScheduleDefined_title
source: Has your pediatrician (or consultant) given you specific times of day to pump?
it: Il tuo pediatra (o consulente) ti ha indicato momenti specifici della giornata in cui tirare il latte?

# bfOnboarding_questionnaire_pediatricPumpingScheduleDefined_option_yes
source: Yes
it: Sì

# bfOnboarding_questionnaire_pediatricPumpingScheduleDefined_option_no
source: No, only when I can
it: No, solo quando riesco

# bfOnboarding_questionnaire_pumpingTimes_title
source: At what times of day should you pump?
it: In quali momenti della giornata dovresti tirare il latte?

# bfOnboarding_questionnaire_pumpingTimes_option_morning
source: Morning (e.g. around HH:MM)
it: Mattina (es. verso le HH:MM)

# bfOnboarding_questionnaire_pumpingTimes_option_afternoon
source: Afternoon (e.g. around HH:MM)
it: Pomeriggio (es. verso le HH:MM)

# bfOnboarding_questionnaire_pumpingTimes_option_eveningNight
source: Evening/night (e.g. around HH:MM)
it: Sera/notte (es. verso le HH:MM)

# bfOnboarding_questionnaire_pumpingTimes_option_other
source: Other (specify in the notes)
it: Altro (specifica nelle note)

# bfOnboarding_questionnaire_pumpingTimesNotes_title
source: If you like, specify approximate times to pump (e.g. 7:00, 13:00, 21:00).
it: Se vuoi, specifica orari indicativi per tirare il latte (es. 7:00, 13:00, 21:00).

# bfOnboarding_questionnaire_pumpingReminders_title
source: Would you like the app to remind you of these pumping times?
it: Vuoi che l’app ti ricordi questi momenti per tirare il latte?

# bfOnboarding_questionnaire_pumpingReminders_option_onTime
source: Yes, with a notification at the specified time
it: Sì, con notifica all’orario indicato

# bfOnboarding_questionnaire_pumpingReminders_option_before
source: Yes, with a reminder shortly before
it: Sì, con un promemoria poco prima

# bfOnboarding_questionnaire_pumpingReminders_option_no
source: No, it’s not necessary
it: No, non è necessario

# bfOnboarding_questionnaire_trackPumpedAmount_title
source: Would you like to record the amount of milk you pump (in ml)?
it: Ti interessa registrare la quantità di latte tirato (in ml)?

# bfOnboarding_questionnaire_trackPumpedAmount_option_yes
source: Yes
it: Sì

# bfOnboarding_questionnaire_nightNotifications_title
source: Would you like to receive reminders during the night?
it: Vuoi ricevere promemoria anche durante la notte?

# bfOnboarding_questionnaire_nightNotifications_option_yes
source: Yes, if it helps follow the pediatrician’s plan
it: Sì, se serve a seguire le indicazioni del pediatra

# bfOnboarding_questionnaire_nightNotifications_option_onlyIfExceeds
source: Only if the maximum agreed interval is exceeded
it: Solo se si supera l’intervallo massimo che avete stabilito

# bfOnboarding_questionnaire_nightNotifications_option_no
source: No, I don’t want notifications at night
it: No, di notte non voglio notifiche

# bfOnboarding_questionnaire_nightIntervalOverrideHours_title
source: Would you like to set a specific maximum interval at night (in hours)?
it: Per la notte vuoi impostare un intervallo massimo specifico (in ore)?

# bfOnboarding_questionnaire_configureOtherChildren_title
source: Would you like to apply these settings to another child?
it: Vuoi impostare queste impostazioni anche per un altro bambino?

# bfOnboarding_questionnaire_configureOtherChildren_option_twin
source: Yes, for another twin from the same birth
it: Sì, per un altro gemello dello stesso parto

# bfOnboarding_questionnaire_configureOtherChildren_option_otherChild
source: Yes, for another child
it: Sì, per un altro bambino

# bfOnboarding_questionnaire_configureOtherChildren_option_no
source: No, only for {childName}
it: No, solo per {childName}

# bfOnboarding_questionnaire_copySettingsForOtherChild_title
source: For the new child, would you like to copy {childName}’s settings and edit them, or start from scratch?
it: Per il nuovo bambino preferisci copiare le impostazioni di {childName} e modificarle dopo, oppure ripartire da zero?

# bfOnboarding_questionnaire_copySettingsForOtherChild_option_copy
source: Copy the settings and then I’ll edit them
it: Copia le impostazioni e poi modifico

# bfOnboarding_questionnaire_copySettingsForOtherChild_option_new
source: Start from scratch
it: Ripartiamo da capo
